sm  = int(input('Введи длину своего елдача (см) '))		#СПРОСИТЬ ЧТО К ЧЕМУ И КАК
rad = int(input('Введи ширину своего елдача (см) '))

if rad <= 0:
	if sm <= 0:
		print('Тян не нужны :3' )	
	else:
		print('Тян не нужны :3' )	 
elif rad >= 4 and rad <=5:
	if sm <= 0:
		print('Тян не нужны :3')
	elif sm < 13:
		print('Мда братишка зато ты умеешь кодить и жмешь сотку от груди' )
	elif sm >= 30:
		print('Черт блять ты мамке своей тоже пиздишь что папка дз весит 90гб?' )
	elif sm >= 20:
		print('Ну и болтяра братэлла дашь подержать?' ) 
	else:
		print('Норм хуец под пивас можно' )
elif rad < 4:
	if sm >= 12:
		print('Тупа лассо кек' )
	elif sm <=0:
		print('Тян не нужны :3')
	else:	
		print('Кому вообще блять сдался етот секс ага?' )	
elif rad >= 90:
	if sm <=0:
		print('Тян не нужны :3')
	else:	
		print('Поздравляю теперь планеты крутятся вокруг твоего хера' )
elif rad >= 6:
	if sm >= 12:
		print('Если засунуть в твою попу вентилятор с оборотами и крутить порнушку на проекторе то тебя можно отправлять бурить гранит ')
	elif sm <= 0:
		print('Тян не нужны :3')
	else:
		print('Иди подрочи бегемоту умник блять хуев на отъебись ты значения будешь в своей ебучей лабе втыкать' )	